% /***********************************************************************************
%  * 文 件 名   : isdecdigital.m
%  * 负 责 人   : whueht@gmail.com
%  * 创建日期   : 2013年08月25日
%  * 文件描述   : 判断字符A的类型
%  * 版权说明   : Copyright (c) 2013-2015
%  * 其    他   : 
%  * 修改日志   : 2013/08/25	创建该文件
% ***********************************************************************************/
function value=isdecdigital(A)
% 判断字符A是否为数值0-9，是否为a-z, 是否为A-Z
% 返回1，表示0-9
% 返回2，表示a-z
% 返回3，表示A-Z
% if (A == '0') || (A == '1') || (A == '2') || (A == '3') || (A == '4') || (A == '5') || (A == '6') || (A == '7') || (A == '8') || (A == '9')   
if (abs(A) >= 48) && (abs(A) <= 57) %'0'-48,'9'-57
   value =  1 ;
elseif (abs(A) >= 97) && (abs(A) <= 122) %'a'-97,'z'-132
   value =  2
elseif (abs(A) >= 65) && (abs(A) <= 90) %'A'-65,'Z'-90
   value =  3 ;
else
   value =  0 ;    
end